# Chapter 7

## 7.1 Handling Missing Data

In [79]:
# pandas uses NaN to represent missing data (sentinel data)

In [80]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [81]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [82]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [83]:
# NA data is datat that does not exist or exists but as not observed

# when cleaning upd ata, it's important to do analysis on missing data to identify data collection problems
# or potential biases in the data caused by missing data

In [84]:
# Python 'None' is also treated as NA

In [85]:
string_data[0] = None

In [86]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [87]:
# dropna: drop column or row if there's a missing data value
# fillna: fill missing data values
# isnull/notnull: return T/F

### Filtering Out Missing Data

In [88]:
# dropna on a series returns series with only the non null data and index values

In [89]:
from numpy import nan as NA

In [90]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [91]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [92]:
# dropa is the same as

In [93]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [94]:
# df objects can drop rows or columns that are all NA or only those containing any NAs
# dropna by default drops any row containing a missing value

In [95]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA , NA], [NA, 6.5, 3.]])

In [96]:
cleaned = data.dropna()

In [97]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [98]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [99]:
# passing how = 'all' will drop rows that are all NA

In [100]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [101]:
# to drop columns with none values, pass axis = 1

In [102]:
data[4] = NA

In [103]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [104]:
data.dropna(axis = 1, how = 'all')
# drop columns where all values are NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [105]:
# another way to filter data conerns time series data
# filter out rows containing a certain number of observations
# use the thresh argument

In [106]:
df = pd.DataFrame(np.random.randn(7, 3))

In [107]:
df.iloc[:4, 1] = NA
# all values in df up to but not including 4 in column index 1 are NA

In [108]:
df.iloc[:2, 2] = NA

In [109]:
df

          0         1         2
0  0.242469       NaN       NaN
1 -0.549561       NaN       NaN
2  0.655193       NaN  0.063168
3 -0.122246       NaN  0.268470
4 -0.050597 -3.373410  1.218583
5 -0.000621  0.438009  0.864580
6 -0.326543  0.700897 -0.464054

In [110]:
df.dropna()

# drop all rows with any NA values

          0         1         2
4 -0.050597 -3.373410  1.218583
5 -0.000621  0.438009  0.864580
6 -0.326543  0.700897 -0.464054

In [111]:
df.dropna(thresh = 2)

# if there are at least 2 non NA values in a row, keep it
# otherwise, drop it

          0         1         2
2  0.655193       NaN  0.063168
3 -0.122246       NaN  0.268470
4 -0.050597 -3.373410  1.218583
5 -0.000621  0.438009  0.864580
6 -0.326543  0.700897 -0.464054

### Filling In Missing Data

In [112]:
# getting rid of rows or columns discards data

# use fillna. Calling fillna with a constant replaces missing values with that value

In [113]:
df.fillna(0)

          0         1         2
0  0.242469  0.000000  0.000000
1 -0.549561  0.000000  0.000000
2  0.655193  0.000000  0.063168
3 -0.122246  0.000000  0.268470
4 -0.050597 -3.373410  1.218583
5 -0.000621  0.438009  0.864580
6 -0.326543  0.700897 -0.464054

In [114]:
# calling fillna with a dict, you can use a different fill value for each column

In [115]:
df.fillna({1: 0.5, 2: 0})

# in column 1, NA values are replaced with .5: column 2, NA replaced with 0

          0         1         2
0  0.242469  0.500000  0.000000
1 -0.549561  0.500000  0.000000
2  0.655193  0.500000  0.063168
3 -0.122246  0.500000  0.268470
4 -0.050597 -3.373410  1.218583
5 -0.000621  0.438009  0.864580
6 -0.326543  0.700897 -0.464054

In [116]:
# fillna returns a new object but you can modify the existing object in place

In [117]:
_ = df.fillna(0, inplace = True)

In [118]:
df

          0         1         2
0  0.242469  0.000000  0.000000
1 -0.549561  0.000000  0.000000
2  0.655193  0.000000  0.063168
3 -0.122246  0.000000  0.268470
4 -0.050597 -3.373410  1.218583
5 -0.000621  0.438009  0.864580
6 -0.326543  0.700897 -0.464054

In [119]:
# same interpolation methods available for reindexing can be used with fillna

In [120]:
df.iloc[2:, 1] = NA

In [121]:
df.iloc[4:, 2] = NA

In [122]:
df

          0    1         2
0  0.242469  0.0  0.000000
1 -0.549561  0.0  0.000000
2  0.655193  NaN  0.063168
3 -0.122246  NaN  0.268470
4 -0.050597  NaN       NaN
5 -0.000621  NaN       NaN
6 -0.326543  NaN       NaN

In [123]:
df.fillna(method='ffill')

          0    1         2
0  0.242469  0.0  0.000000
1 -0.549561  0.0  0.000000
2  0.655193  0.0  0.063168
3 -0.122246  0.0  0.268470
4 -0.050597  0.0  0.268470
5 -0.000621  0.0  0.268470
6 -0.326543  0.0  0.268470

In [124]:
df.fillna(method = 'ffill', limit = 2)

# ffill only works with next 2 indexes

          0    1         2
0  0.242469  0.0  0.000000
1 -0.549561  0.0  0.000000
2  0.655193  0.0  0.063168
3 -0.122246  0.0  0.268470
4 -0.050597  NaN  0.268470
5 -0.000621  NaN  0.268470
6 -0.326543  NaN       NaN

In [125]:
# fillna can pass the mean or median of a series

In [126]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [127]:
data.fillna(data.mean())

# indexes 1, and 3 are NA and are thus filled with the mean

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

In [128]:
# so far been focusing on rearranging data

# also want to focus on filtering, cleaning, and other transformations

### Removing Duplicates

In [129]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [130]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [131]:
# df.duplicated returns a boolean Series indicating whether each row is a duplicate

In [132]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [133]:
# df.drop_duplicates returns a df where the duplicated array is False

In [134]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [135]:
# above 2 methods check all columns but you can specify any subset to detect dulicates

In [136]:
# suppose we wanted to filter duplicates based on the 'k1' column

In [137]:
data['v1'] = range(7)

# we create a column in data called 'v1' and fill it with values from 0-6

In [138]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [139]:
data.drop_duplicates(['k1'])

# we drop rows based on the duplicates in k1

    k1  k2  v1
0  one   1   0
1  two   1   1

In [140]:
# by default df.duplicated and df.drop_duplicates keep the first observed value combination
# passing keep = 'last' will return the last one

In [141]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [142]:
# notice above, usualy index 5 would be kept and index6 dropped but because we passed 'last' to keep, we 
# dropped index 5

### Transforming Data Using a Function or Mapping

In [143]:
# sometimes you'll want to perform a trasnformation based on the values in an array, series, or column in a df

In [144]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami',
                             'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [145]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [146]:
# suppose you wanted to add a column indicating the type of animal each food came from

# let's write. amapping of each distinct meat type to type of animal

In [147]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [148]:
# map method in series accepts a funciton or dict like obj containing a mapping. 
# however in our df, some meats are capitalized while others are not
# so we gota use str.lower on the Series method

In [149]:
lowercased = data['food'].str.lower()

In [150]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [151]:
data['animal'] = lowercased.map(meat_to_animal)

In [152]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [153]:
# could also pass a function to do all the work

In [154]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing values

In [155]:
# replace is a simpler and flexible way to modify a subset of values in an obj

In [156]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [157]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [158]:
# the -999 might be sentinel values for missing data
# we'll replace them with NA by using df.replace, producing a new Series

In [159]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [160]:
# if you want to replace multiple values at once, just pass a list of the vlaues

In [161]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [162]:
# can use different replacements for each value and pass a list of substitutes

In [163]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [164]:
# argument passed can also be a dict

In [165]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [166]:
# bottom of page 205 stop

### Renaming Axis Indexes

In [167]:
# axis labels can be trasnformed by a function or mapping to form new differently labled objects
# you can also modify the axes in place

In [168]:
data = pd.DataFrame(np.arange(12).reshape(3,4), index = ['Ohio', 'Colorado', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])

In [169]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [170]:
transform = lambda x: x[:4].upper()

In [171]:
data.index.map(transform)
# all this did was take the first 4 lettesr of every row
# index.map is how every index value was captalized

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [172]:
# you can also assign to index to modify the df in place

In [173]:
data.index = data.index.map(transform)

In [174]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [175]:
# you can transform a dataset without modifying the original by using df.rename

In [176]:
data.rename(index=str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [177]:
# rename can be used in conjusction with dict like obj to provide new values for a subset of the axis labels

In [178]:
data.rename(index = {'OHIO': 'INDIANA'}, 
          columns = {'three': 'peekaboo'})

# key 'OHIO' is replaced by value 'INDIANA'
# same thing for 'three' and 'peekaboo'

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [179]:
# rename is good for not copying the df manually and assinging to its index and columns attribute
# can use inplace = True

In [180]:
data.rename(index={'OHIO': 'INDIANA'}, inplace = True)

In [181]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [182]:
# discretization is when continus data is separated into 'bins' for analysis

In [183]:
# suppose you have a data about a gorup of people in a study and you want to group them into discrete age buckets (bin)

In [228]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [229]:
# we're gonna divide into bins of 18-25, 26-35, 36-60, and 61 >
# we're gonna use 'pd.cut'

In [230]:
bins = [18, 25, 35, 60, 100]

In [231]:
cats = pd.cut(ages, bins)
# ages is the list passed, bins are the separaters

In [232]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [233]:
# so pd.cut looks at every value in ages and assigns it to one of the bins

In [234]:
# the object pandas returns is a special 'Categoricial' obj
# the output describes the bins computed by pandas.cut
# can treat it like an arr of strings indicating the bin name
# interanlly it contains a categories array specifying the distinct category names along with
# a labeling for the ages data in the codes attribute

In [235]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [236]:
# 0 is the zero-eth bin (18, 25], 1 is the first bin (25, 35) and so on

In [237]:
cats.categories
# see all the categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [238]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [239]:
# pd.value_counts(cats)  are the bin counts for the results of pandas.cut
# also I think for borderline variales (25), pd.cuts places it in the first inclusive bin and that's how it decides

In [240]:
# parentheses and brackets

# [a, b) - all numbers between a and b, including a, but not including b

# (a, b] - all numbers between a and b, including b, but not including a
# you can change which side is open and closed by passing right = False:

pd.cut(ages, [18, 26, 36, 61, 100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [241]:
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [242]:
ages.codes

# this doesn't make sense, [18, 26) should be all numbers between 18 and 26, including 18 but not ncluding 26
# so 26 should be 0 but 1

AttributeError: 'list' object has no attribute 'codes'

In [243]:
# you can also pass your own bin names by passing a lis tor arr to the labels option

In [244]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [245]:
new_cats = pd.cut(ages, bins, labels=group_names)

In [246]:
# if you pass an integer number of bins to cut instead of explicit bin edges, it will compute equal length
# bins based on the min and mx values in teh data

In [247]:
data = np.random.rand(20)

In [222]:
pd.cut(data, 4, precision = 2)

[(0.47, 0.67], (0.27, 0.47], (0.27, 0.47], (0.47, 0.67], (0.068, 0.27], ..., (0.67, 0.88], (0.27, 0.47], (0.47, 0.67], (0.068, 0.27], (0.67, 0.88]]
Length: 20
Categories (4, interval[float64]): [(0.068, 0.27] < (0.27, 0.47] < (0.47, 0.67] < (0.67, 0.88]]

In [223]:
# precision = 2 limits the decimal precision to 2 units

In [248]:
# qcut bins the data based on sample quantiles
# depending on the distrubtion of the data, using cut will not result in each bin having the same number of data points
# qcut uses sample quantiles instead, which will yeild roughly equal size bins

In [249]:
data = np.random.randn(1000)

In [251]:
cats = pd.qcut(data, 4) # cu into 3 quartiles

In [252]:
cats

[(-0.0236, 0.66], (0.66, 3.19], (0.66, 3.19], (-3.522, -0.702], (-0.702, -0.0236], ..., (-3.522, -0.702], (-3.522, -0.702], (-0.0236, 0.66], (-0.0236, 0.66], (-0.0236, 0.66]]
Length: 1000
Categories (4, interval[float64]): [(-3.522, -0.702] < (-0.702, -0.0236] < (-0.0236, 0.66] < (0.66, 3.19]]

In [254]:
pd.value_counts(cats)

(-3.522, -0.702]     250
(-0.702, -0.0236]    250
(-0.0236, 0.66]      250
(0.66, 3.19]         250
dtype: int64

In [255]:
# you can also use qcut by passing your own quantiles (numbers between 0-1, inclusive)

In [256]:
set = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0236, 1.282], (-0.0236, 1.282], (1.282, 3.19], (-3.522, -1.329], (-1.329, -0.0236], ..., (-3.522, -1.329], (-3.522, -1.329], (-0.0236, 1.282], (-0.0236, 1.282], (-0.0236, 1.282]]
Length: 1000
Categories (4, interval[float64]): [(-3.522, -1.329] < (-1.329, -0.0236] < (-0.0236, 1.282] < (1.282, 3.19]]

## Detecting and Filtering Outliers

In [261]:
# filtering/transforming outliers is a matter of applying array operations

In [263]:
data = pd.DataFrame(np.random.randn(1000,4))

In [264]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.047173    -0.015904    -0.033272    -0.024742
std       0.999428     0.973251     1.029499     1.033945
min      -3.608286    -2.640237    -3.297490    -2.934189
25%      -0.713081    -0.676315    -0.697066    -0.772097
50%      -0.004611    -0.026770    -0.009754    -0.011034
75%       0.623286     0.563787     0.661197     0.692390
max       3.016632     3.192674     4.379918     3.017836

In [265]:
# find all values in a column which exceed 3 in abs value

In [266]:
col = data[2]

In [267]:
col[np.abs(col) > 3]
# np.abs(col) compares every row in column 2 to '> 3', if true, returns their index and value from data[2]

299    3.612604
585   -3.297490
792    4.379918
900    3.321776
Name: 2, dtype: float64

In [268]:
# to select all rows having a value exceeding 3 or -3, use the 'any' method on a boolean df

In [269]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
145 -3.608286  0.100291 -1.151523 -1.709857
150 -3.164186 -2.640237 -1.805878  2.050083
283 -0.459812  3.174139  1.422327 -1.698535
299 -1.713181  1.620324  3.612604  0.342954
426  3.016632 -0.537517 -0.373105  2.011539
445 -3.166735  1.568423 -0.729017  3.017836
585 -0.070862 -0.313799 -3.297490  0.724316
739  1.395050  3.192674  1.288257  0.460915
792 -0.910412  0.899369  4.379918 -1.113493
900  0.504567  1.205429  3.321776  0.328439

In [270]:
# values can be set based on criteria
# code below caps values outside the interval -3 to 3

In [272]:
data[np.abs(data) > 3] = np.sign(data) * 3

# sign returns the sign (- for negative, 0 for value == 0, and 1 for positive)

In [273]:
data.describe()

# data looks at column 1
# if abs(value) > 3, then the value = 3 or -3, depending on sign

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046251    -0.016271    -0.035288    -0.024759
std       0.996382     0.972077     1.020573     1.033893
min      -3.000000    -2.640237    -3.000000    -2.934189
25%      -0.713081    -0.676315    -0.697066    -0.772097
50%      -0.004611    -0.026770    -0.009754    -0.011034
75%       0.623286     0.563787     0.661197     0.692390
max       3.000000     3.000000     3.000000     3.000000

### Permutation and Rnadom Sampling

In [274]:
# Permuting (randomly reording) a Series or the rows in a df can be done using numpy.random.permutation
# can also call 'permutation' with the length of the axis you want to permute produces an arr of ints 
# indicating the new ordering

In [275]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [276]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [285]:
sampler = np.random.permutation(5)

In [286]:
sampler # every time you call sampler above, a new ordering is set

array([1, 2, 4, 0, 3])

In [287]:
# can then use iloc indexing or the equilvaent take function

In [288]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [290]:
df.take(sampler)
# pass the random order from sampler using take and this changes the order of the index

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

In [291]:
# to select a random subset w/o replacement, you can use the df.sample method on Series and df

In [292]:
df.sample(n=3) (pick 3 random rows )

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [293]:
# to generate a sample with replacement (to allow repeat choices), pass replace = True to df.sample

In [300]:
choices = pd.Series([5, 7, -1, 6, 4])

In [301]:
draws = choices.sample(n = 10, replace = True)

In [302]:
draws

4    4
4    4
1    7
0    5
4    4
0    5
4    4
0    5
2   -1
4    4
dtype: int64

In [303]:
# replace = True is like n = 10 drawing, draw 1 from deck of cards, put back, reshuffle, then draw again

### Computing Indicator/Dummy Variables

In [304]:
# another type of trasnformaton for stat modeling or ML is converting a categorical variable into a dummy/indicator 
# matrix

# if a column in a df has k distinct values, you would derive a matrix of df with k columns containing all 1s and 0s

#pandas has a get_dummies function for doing this

In [305]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
                  'data1': range(6)})

In [307]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [306]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [308]:
# dis is weird but look at the key above

# 'key': ['b', 'b', 'a', 'c', 'a', 'b']

# in our df, for the 'a categorical variable'
# index 0 has a b so C['a']'s row 0 is a 0
# same for index 1, c['a']'s row 1 is a 0
# now at index 2, in the key, the value is 'a'
# because the value is 'a' in the key and the current column in the df is 'a', the current position evaluates to '1'

In [309]:
# sometimes you may want to add a prefix to the columns in the dindicator df which can then be merged with other data
# pd.get_dummies has a prefix arg for this

In [312]:
dummies = pd.get_dummies(df['key'], prefix = 'key')

In [313]:
df_with_dummy = df[['data1']].join(dummies)

In [314]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [315]:
# prefix just adds the 'key_' to the front of every column
# df[['data1']].join(dummies) just adds the data1 column in front

In [316]:
# things get a little more ocmplicated when a row in a df belongs to multiple categories

In [323]:
mnames = ['movie_id', 'title', 'genres']

In [330]:
!wget https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/datasets/movielens/movies.dat

--2021-07-26 09:51:22--  https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/datasets/movielens/movies.dat
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.111.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 171308 (167K) [text/plain]
Saving to: movies.dat

movies.dat          100%[===================>] 167.29K  --.-KB/s    in 0.02s

2021-07-26 09:51:23 (7.44 MB/s) - movies.dat saved [171308/171308]

In [336]:
movies = pd.read_table('movies.dat' , sep = '::',
                      header = None, names = mnames, engine = 'python')

In [337]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [338]:
# we want to add indicator variables for each genre
# first we extract list of unique genres in the dataset

In [339]:
all_genres = []

In [343]:
for x in movies.genres:
    all_genres.extend(x.split('|'))
# .extend is like append
# add every value from movies.genres to all_genres

In [360]:
genres = pd.unique(all_genres)
# only look at the unique values from all_genres

In [361]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [346]:
# can construct indicator df with a df of all zeros

In [368]:
zero_matrix = np.zeros((len(movies), len(genres)))
len(movies)
len(genres)
# make a dataframe that is all zeros with rows (len(movies)) and columns (len(genres))

3883

In [366]:
zero_matrix

array([[0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       ...,
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.],
       [0., 0., 0., ..., 0., 0., 0.]])

In [348]:
dummies = pd.DataFrame(zero_matrix, columns = genres)

In [349]:
# now iterate through each movie, and set entries in each row of dumies to 1
# can do this by using the dummies.column to compute the column indices for each genre

In [379]:
gen = movies.genres[0]

In [380]:
gen

"Animation|Children's|Comedy"

In [381]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [352]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [354]:
# then use .iloc to set values based on these indices

In [382]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [357]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
# combine 
# oh so for every movie, it looks to see if it matches any of the genres

In [359]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [383]:
# with largeter data sets, the above method of constructing indicator variables iwht ultiple membership is not speedy,
# better to write. a lower level function that writes directly to a np array and then wrap results in a df

In [384]:
# can combine get_dummies with a discretization func like 'cut'

In [385]:
np.random.seed(12345)

In [386]:
values = np.random.rand(10)

In [387]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [388]:
bins = [0, .2, .4, .6, .8, 1]

In [389]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [390]:
# oh see, at every value in row, it checks which bin it belongs to and then places it there
# random seed is used to make example deterministic

## String Manipulation

In [391]:
# pretty much pandas works well with regex

### String Object Methods

In [392]:
# comma sepearated string can be broken ino pieces wiht split

In [420]:
val = 'a,b, guido'

In [421]:
val.split(',')

['a', 'b', ' guido']

In [422]:
# strip is often combined with strip to trim whitespace

In [423]:
pieces = [x.strip() for x in val.split(',')]

# apply x.strip() to every value x

In [424]:
pieces

['a', 'b', 'guido']

In [425]:
# strings can be concatenated toegether with a 2 colon delimiter using addition

In [426]:
first, second, third = pieces

In [427]:
first + '::'  + second + '::' + third

'a::b::guido'

In [428]:
# a better way would be to pass a list or tuple to the join method on the string '::'

In [429]:
'::'.join(pieces)

'a::b::guido'

In [430]:
# an use python's in to detect a substring
# can also use index and find

In [431]:
'guido' in val # boolean

True

In [432]:
val.index(',') # index location of ','

1

In [433]:
val.find(':')

# evaulates to -1 if not found

-1

In [434]:
# index raises an excepion if the value is not found

In [435]:
val.index(':')

ValueError: substring not found

In [436]:
# count returns the number of occurences of a particular substring

In [437]:
val.count(',')

2

In [438]:
val

'a,b, guido'

In [439]:
# 'replace'  will substitue occurences of one pattern for another

In [440]:
val.replace(',', '::')

# so any comma will be replaced by '::'

'a::b:: guido'

In [441]:
val.replace(',', '')

'ab guido'

## Regex

In [442]:
# python uses the re module

# re module has 3 categories
# - pattern matching
# - sbustituion
# - splitting

In [443]:
# we wanna split a str with a varialbe number of white space characters (tabs, spaces, \n)

In [444]:
import re

In [451]:
text = 'foobar\t baz \tqux'

In [453]:
re.split('\s+', text)

# when this code is called, the regex is first compiled and then split method is called on the text

['foobar', 'baz', 'qux']

In [454]:
# can compile regex yourself with re.compile forming a reusable regex obj

In [455]:
regex = re.compile('\s+')

In [457]:
regex.split(text)

['foobar', 'baz', 'qux']

In [458]:
# get list of all patterns matching regex, use 'findall'

In [459]:
regex.findall(text)

# in the text, see which patterns match to your regex

['\t ', ' \t']

In [460]:
# use re.compile if you intentd to apply the same epression to many strs

In [461]:
# 'match' and 'search' are related to 'findall'

In [462]:
# 'findall' returns all matches in a string while 'search' returns the first match 
# 'match' only matches at the beginning of a str

In [539]:
text = """
Dave dave@google.com
Steve Steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [540]:
# re.IGNORECASE makes the regex case IN-sensitive

In [541]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [542]:
regex.findall(text)

['dave@google.com', 'Steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [543]:
# 'search' returns a special match obj for the first email address int he text

# in text (above), the match obj can only telll us the start and end pos of a pattern

In [544]:
m = regex.search(text)

In [545]:
m

In [546]:
text[m.start():m.end()]

'dave@google.com'

In [547]:
# regex.match returns none cause it will only match if the pattern occurs at the start of a str

In [548]:
print(regex.match(text))

None

In [549]:
# sub will return a new str with occurneces of the pattern returned by the new str

In [550]:
print(regex.sub('REDACTED', text))

# 'REDACTED' is what will replace the values that are matched with regex, text is what where regex.sub is looking at

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [551]:
# WANT TO FIND EMAIL ADDRESSES AND SEGMENT EACH ADDRESS INTO THREE COMPONENTS: USERNAME, DOMAIN NAME AND DOMAIN SUFFIX
# DO THIS BY PUTTING PARENTHESESAROUND THE PARTS OF THE PATTERN TO SEGMENT

pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [552]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [553]:
# match method roduced by this modified regex returns a tuple of the pattern components with its groups methods

In [554]:
m = regex.match('wesm@bright.net')

In [555]:
m

In [556]:
m.groups()

('wesm', 'bright', 'net')

In [557]:
# findall returns a list of tuples whent he pattern has groups

In [558]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('Steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [559]:
# sub also has access to grups in each match using special symbols like \1, \2
# \1 corresponds to the first matched group, \2 the second matched group, and so on

In [560]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: Steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized Str Functions in Pandas

In [561]:
# sometimes a column containing strings will sometimes have missing data

In [562]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 
       'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [563]:
data = pd.Series(data)

In [564]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [565]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [566]:
# can apply str and regex expressions to each value but it will fail on the null values

# series has arr oriented methods for skipping NA values

# accessed through Series' Str attribute

# 'str.contains'

In [567]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [568]:
# can also use regex

In [578]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [579]:
data.str.findall(pattern, flags = re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [580]:
# can also do vectorized elemnt retrieval
# use str.get or index into the str attribute

In [581]:
matches = data.str.findall(pattern, flags = re.IGNORECASE).str[0]

In [582]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [583]:
matches.str.get(1)

# get the first index from each row

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [584]:
# or you can slice strs using

In [585]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [586]:
# extract returns the captured groups of a regex as a df

In [587]:
data.str.extract(pattern, flags = re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN